# coding: utf-8


map_name = {
    1: u"松哥",
    2: u"飞",
    3: u"灰灰",
    4: u"江哥",
    5: u"寝室长",
    6: u"凌云",
}

map_point = {
    10001: {
        "des": u"看见{}在洗澡".format(map_name[1]),
        "A": 20001,
        "B": 20002,
        "img": "",
    },
    10002: {
        "des": u"{}变成了丧尸".format(map_name[2]),
        "A": 20003,
        "B": 20004,
        "img": "",
    },
    10003: {
        "des": u"碰巧遇到{}在做手抓饼".format(map_name[3]),
        "A": 20005,
        "B": 20006,
        "img": "",
    },
    10004: {
        "des": u"偶遇{}洗澡".format(map_name[4]),
        "A": 20007,
        "B": 20008,
        "img": "",
    },
    10005: {
        "des": u"碰巧看到{}在骑自行车".format(map_name[6]),
        "A": 20009,
        "B": 20010,
        "img": "",
    },
    10006: {
        "des": u"看到{}在跑批".format(map_name[5]),
        "A": 20011,
        "B": 20012,
        "img": "",
    },
}

map_choose = {
    20001: {
        "des": u"趁他洗头发时向头发上加洗发露",
        "res": u"洗头发洗到秃顶，你的内心充满愧疚",
        "score": -1,
    },
    20002: {
        "des": u"堵死下水道并锁住浴室大门",
        "res": u"松哥被水淹没后意外获得了超能力",
        "score": 2,
    },
    20003: {
        "des": u"拿起斧子去把它干掉",
        "res": u"自不量力，被丧失追杀，十分狼狈",
        "score": -2,
    },
    20004: {
        "des": u"假装是丧尸的同类",
        "res": u"蒙混过关，甚至和僵尸成为了好朋友",
        "score": 1,
    },
    20005: {
        "des": u"上去捣乱",
        "res": u"迫使对方多做了一个手抓饼，饱餐一顿",
        "score": 1,
    },
    20006: {
        "des": u"上去帮忙",
        "res": u"锅糊了，饿了一整天",
        "score": -1,
    },
    20007: {
        "des": u"上去帮忙搓背",
        "res": u"江哥舒服出猪叫",
        "score": 1,
    },
    20008: {
        "des": u"绊他",
        "res": u"江哥摔了个狗吃屎",
        "score": 2,
    },
    20009: {
        "des": u"大喊一声云遮天",
        "res": u"意外获得成就--'祖安文科状元'",
        "score": 1,
    },
    20010: {
        "des": u"找他翻旧账",
        "res": u"被反喷的体无完肤",
        "score": -2,
    },
    20011: {
        "des": u"询问他和主任的关系",
        "res": u"被他反身一个王者之拉打成残血",
        "score": -1,
    },
    20012: {
        "des": u"让他保重身体",
        "res": u"对方邪魅一笑",
        "score": 1,
    },
}